
[
    
{
"Term": "The Lord prepares a way to obey His commandments",
"Book":"BofM",
"Definition": 
"1 Nephi 3:7\r\n1 Nephite \r\n3 rings on plates \r\nThe Lord prepared a way to get those plates \r\n\r\n7 And it came to pass that I, Nephi, said unto my father: I will go and do the things which the Lord hath commanded, for I know that the Lord giveth no commandments unto the children of men, save he shall prepare a way for them that they may accomplish the thing which he commandeth them.",

"Category" : "Commandments"
},
{
  "Term": "Adam fell that men might be",
"Book": "BofM",
"Definition": "2 Nephi 2:22-25\r\n2 Nephites grateful for the fall\r\nThey, like Adam and Eve took 2 bites\r\n\r\n22 And now, behold, if Adam had not transgressed he would not have fallen, but he would have remained in the garden of Eden. And all things which were created must have remained in the same state in which they were after they were created; and they must have remained forever, and had no end.\r\n23 And they would have had no children; wherefore they would have remained in a state of innocence, having no joy, for they knew no misery; doing no good, for they knew no sin.\r\n24 But behold, all things have been done in the wisdom of him who knoweth all things.\r\n25 Adam fell that men might be; and men are, that they might have joy.",

"Category":"The Plan of Salvation"
},
{
"Term": "We are free to choose liberty or captivity",
"Book":"BofM", 
"Definition": "2 Nephi 2:27\r\n2 Nephites with 2 choices are free 2 choose liberty or captivity\r\n\r\n27 Wherefore, men are free according to the flesh; and all things are given them which are expedient unto man. And they are free to choose liberty and eternal life, through the great Mediator of all men, or to choose captivity and death, according to the captivity and power of the devil; for he seeketh that all men might be miserable like unto himself.",
"Category":"The Plan of Salvation"
},
{
"Term":"All are alike unto God",
"Book" :"BofM",
"Definition":"Nephi 26:33\r\n2 Nephites are happy to know that all the people in the numbers are alike UN2 God\r\n\r\n33 For none of these iniquities come of the Lord; for he doeth that which is good among the children of men; and he doeth nothing save it be plain unto the children of men; and he inviteth them all to come unto him and partake of his goodness; and he denieth none that come unto him, black and white, bond and free, male and female; and he remembereth the heathen; and all are alike unto God, both Jew and Gentile.",
"Category":"The Godhead"
}
{

"Term":"God gives knowledge line upon line.",
"Book":"BofM",
"Definition":"2 Nephi 28:30\r\n2 Nephits\r\nGod giving 28 lines of revelation (knowledge)\r\n\r\n30 For behold, thus saith the Lord God: I will give unto the children of men line upon line, precept upon precept, here a little and there a little; and blessed are those who hearken unto my precepts, and lend an ear unto my counsel, for they shall learn wisdom; for unto him that receiveth I will give more; and from them that shall say, We have enough, from them shall be taken away even that which they have.",
"Category": "Acquiring Spiritual Knowledge"
},
{
"Term":"If we feast upon the words of Christ, we can know all things that we should do",
"Book":"BofM",
"Definition":"2 Nephi 32:3\r\n2 Nephites feasting upon the word with 32 oz slurpee\r\n\r\n3 Angels speak by the power of the Holy Ghost; wherefore, they speak the words of Christ. Wherefore, I said unto you, feast upon the words of Christ; for behold, the words of Christ will tell you all things what ye should do.",
"Category":"Acquiring Spiritual Knowledge"
},
{
"Term" :"If we pray always, God will consecrate our performance for the welfare of our souls.",
"Book":"BofM",
"Definition": "2 Nephi 32:8-9\r\n2 Nephites praying so that God will consecrate their drinking a 32 oz slurpee\r\n\r\n8 And now, my beloved brethren, I perceive that ye ponder still in your hearts; and it grieveth me that I must speak concerning this thing. For if ye would hearken unto the Spirit which teacheth a man to pray ye would know that ye must pray; for the evil spirit teacheth not a man to pray, but teacheth him that he must not pray.\r\n9 But behold, I say unto you that ye must pray always, and not faint; that ye must not perform any thing unto the Lord save in the first place ye shall pray unto the Father in the name of Christ, that he will consecrate thy performance unto thee, that thy performance may be for the welfare of thy soul.",
"Category":"Acquiring Spiritual Knowledge"
},
{
"Term": "By serving others we serve God",
"Book":"BofM",
"Definition": "Mosiah 2:17\r\nNose Eye A for Mosiah\r\nTwo goblets for 2\r\nServe God (one goblet) and others (the other goblet)\r\n\r\n17 And behold, I tell you these things that ye may learn wisdom; that ye may learn that when ye are in the service of your fellow beings ye are only in the service of your God.",
"Category":"Commandments"
},{
"Term": "Obedience brings blessings and happiness.",
"Book":"BofM",
"Definition": "Mosiah 2:41\r\nNose Eye A for Mosiah\r\n2 hands on his head for 2\r\nHe's happy because he's keeping the commandments\r\n\r\n41 And moreover, I would desire that ye should consider on the blessed and happy state of those that keep the commandments of God. For behold, they are blessed in all things, both temporal and spiritual; and if they hold out faithful to the end they are received into heaven, that thereby they may dwell with God in a state of never-ending happiness. O remember, remember that these things are true; for the Lord God hath spoken it.",
"Category":"Commandments",
},
{
"Term":"Put off the natural man and become a Saint through the Atonement.",
"Book":"BofM",
"Definition":"Mosiah 3:19\r\nNose Eye A (Mosiah) \r\n3 rings for 3\r\nNatural (angry) man\r\n\r\n19 For the natural man is an enemy to God, and has been from the fall of Adam, and will be, forever and ever, unless he yields to the enticings of the Holy Spirit, and putteth off the natural man and becometh a saint through the atonement of Christ the Lord, and becometh as a child, submissive, meek, humble, patient, full of love, willing to submit to all things which the Lord seeth fit to inflict upon him, even as a child doth submit to his father.\r\nThe Atonement of Jesus Chris,{Believe in God and that He has all wisdom\r\nBofM - < Term Definition > Mosiah 4:9\r\nBig Nose Eye for Mosiah\r\nBee-leaf in God that He has all wisdom\r\nOn a 4 leaf clover for 4\r\n\r\n9 Believe in God; believe that he is, and that he created all things, both in heaven and in earth; believe that he has all wisdom, and all power, both in heaven and in earth; believe that man doth not comprehend all the things which the Lord can comprehend.\r\nAcquiring Spiritual Knowledg,{Through baptism we enter a covenant with God\r\nBofM - < Term Definition > Mosiah 18:8-10\r\nNose eye a for Mosiah\r\n18 year-old missionary for 18\r\n\r\n8 And it came to pass that he said unto them: Behold, here are the waters of Mormon (for thus were they called) and now, as ye are desirous to come into the fold of God, and to be called his people, and are willing to bear one another's burdens, that they may be light;\r\n9 Yea, and are willing to mourn with those that mourn; yea, and comfort those that stand in need of comfort, and to stand as witnesses of God at all times and in all things, and in all places that ye may be in, even until death, that ye may be redeemed of God, and be numbered with those of the first resurrection, that ye may have eternal life-\r\n10 Now I say unto you, if this be the desire of your hearts, what have you against being baptized in the name of the Lord, as a witness before him that ye have entered into a covenant with him, that ye will serve him and keep his commandments, that he may pour out his Spirit more abundantly upon you?",
"Category":"Ordinances and Covenant",
},{
"Term":"Jesus Christ experienced our pains and overcame sin and death",
"Book":"BofM",
"Definition": Alma 7:11-13
Bird is an owl for Owlma
Christ suffered the 7 listed afflictions

11 And he shall go forth, suffering pains and afflictions and temptations of every kind; and this that the word might be fulfilled which saith he will take upon him the pains and the sicknesses of his people.
12 And he will take upon him death, that he may loose the bands of death which bind his people; and he will take upon him their infirmities, that his bowels may be filled with mercy, according to the flesh, that he may know according to the flesh how to succor his people according to their infirmities.
13 Now the Spirit knoweth all things; nevertheless the Son of God suffereth according to the flesh that he might take upon him the sins of his people, that he might blot out their transgressions according to the power of his deliverance; and now behold, this is the testimony which is in me.
The Atonement of Jesus Chris,{There must be an Atonement made.
BofM - < Term Definition > Alma 34:9-10
Bird is an owl for Owlma
Christ's suffered atonement in His 34th year
Roman Numeral 34 on rock

9 For it is expedient that an atonement should be made; for according to the great plan of the Eternal God there must be an atonement made, or else all mankind must unavoidably perish; yea, all are hardened; yea, all are fallen and are lost, and must perish except it be through the atonement which it is expedient should be made.
10 For it is expedient that there should be a great and last sacrifice; yea, not a sacrifice of man, neither of beast, neither of any manner of fowl; for it shall not be a human sacrifice; but it must be an infinite and eternal sacrifice.
The Atonement of Jesus Chris,{Go no more after the lust of your eyes
BofM - < Term Definition > Alma 39:9
Owl for Owlma
lust crossed out = Don't go after lusts of eyes

9 Now my son, I would that ye should repent and forsake your sins, and go no more after the lusts of your eyes, but cross yourself in all these things; for except ye do this ye can in nowise inherit the kingdom of God. Oh, remember, and take it upon you, and cross yourself in these things.
Marriage and Famil,{Wickedness never was happiness
BofM - < Term Definition > Alma 41:10
Owl for Owlma 
Wicked Owlma not happy

10 Do not suppose, because it has been spoken concerning restoration, that ye shall be restored from sin to happiness. Behold, I say unto you, wickedness never was happiness.
Commandment,{Build your foundation on Christ.
BofM - < Term Definition > Helaman 5:12
Doctor for Heal A Man
His hand for 5
The rock is Christ

12 And now, my sons, remember, remember that it is upon the rock of our Redeemer, who is Christ, the Son of God, that ye must build your foundation; that when the devil shall send forth his mighty winds, yea, his shafts in the whirlwind, yea, when all his hail and his mighty storm shall beat upon you, it shall have no power over you to drag you down to the gulf of misery and endless wo, because of the rock upon which ye are built, which is a sure foundation, a foundation whereon if men build they cannot fall.
The Atonement of Jesus Chris,{Jesus Christ suffered the will of the Father in all things.
BofM - < Term Definition > 3 Nephi 11:10-11
3 Nephites humbly grateful that Christ suffered (hands scarred) the will of the Father

10 Behold, I am Jesus Christ, whom the prophets testified shall come into the world.
11 And behold, I am the light and the life of the world; and I have drunk out of that bitter cup which the Father hath given me, and have glorified the Father in taking upon me the sins of the world, in the which I have suffered the will of the Father in all things from the beginning.
The Godhea,{Jesus Christ invites us to become perfect
BofM - < Term Definition > 3 Nephi 12:48
3 Nephites like the Father and the Son
12 allow for a perfect square

48 Therefore I would that ye should be perfect even as I, or your Father who is in heaven is perfect.
The Godhea,{Watch and pray always in the name of Jesus Christ
BofM - < Term Definition > 3 Nephi 18:15, 20-21
3 Nephites praying
18 year old missionary with Christ's name on him

15 Verily, verily, I say unto you, ye must watch and pray always, lest ye be tempted by the devil, and ye be led away captive by him.
20 And whatsoever ye shall ask the Father in my name, which is right, believing that ye shall receive, behold it shall be given unto you.
21 Pray in your families unto the Father, always in my name, that your wives and your children may be blessed.
The Godhea,{Be baptized and sanctified by receiving the Holy Ghost
BofM - < Term Definition > 3 Nephi 27:20
3 Nephites have repented, were baptized and received the Holy Ghost, they are sanctified (clean) to stand spotless before God

20 Now this is the commandment: Repent, all ye ends of the earth, and come unto me and be baptized in my name, that ye may be sanctified by the reception of the Holy Ghost, that ye may stand spotless before me at the last day.
Ordinances and Covenant,{A witness comes after the trial of faith
BofM - < Term Definition > Ether 12:6
Ether eggs
Dozen = 12
Mallet for witness after faith is tried
Notice "faith" on the Mallet

6 And now, I, Moroni, would speak somewhat concerning these things; I would show unto the world that faith is things which are hoped for and not seen; wherefore, dispute not because ye see not, for ye receive no witness until after the trial of your faith.
Acquiring Spiritual Knowledg,{The Savior can make weak things strong
BofM - < Term Definition > Ether 12:27
Ether eggs 
A dozen eggs for Ether 12
Weak guy (skinny right arm) made strong (buff left arm)

27 And if men come unto me I will show unto them their weakness. I give unto men weakness that they may be humble; and my grace is sufficient for all men that humble themselves before me; for if they humble themselves before me, and have faith in me, then will I make weak things become strong unto them.
The Atonement of Jesus Chris,{Charity is the pure love of Christ
BofM - < Term Definition > Moroni 7:45, 47-48
Gold angel = Moroni
7 words "Charity is the pure love of Christ"

45 And charity suffereth long, and is kind, and envieth not, and is not puffed up, seeketh not her own, is not easily provoked, thinketh no evil, and rejoiceth not in iniquity but rejoiceth in the truth, beareth all things, believeth all things, hopeth all things, endureth all things.
47 But charity is the pure love of Christ, and it endureth forever; and whoso is found possessed of it at the last day, it shall be well with him.
48 Wherefore, my beloved brethren, pray unto the Father with all the energy of heart, that ye may be filled with this love, which he hath bestowed upon all who are true followers of his Son, Jesus Christ; that ye may become the sons of God; that when he shall appear we shall be like him, for we shall see him as he is; that we may have this hope; that we may be purified even as he is pure. Amen.
Commandment,{The Holy Ghost reveals truth to those who ask God with real intent.
BofM - < Term Definition > Moroni 10:4-5
Angel Moroni for Moroni
10 fingers praying if the book is true

4 And when ye shall receive these things, I would exhort you that ye would ask God, the Eternal Father, in the name of Christ, if these things are not true; and if ye shall ask with a sincere heart, with real intent, having faith in Christ, he will manifest the truth of it unto you, by the power of the Holy Ghost.
5 And by the power of the Holy Ghost ye may know the truth of all things.
Acquiring Spiritual Knowledg,{In the First Vision, God called Joseph Smith to be a prophet.
D&C Year (in PofGP) - < Term Definition > Joseph Smith-History 1:15-20
Joseph Smith's First Vision
The Restoratio,{The voice of the Lord and His servants is the same.
D&C - < Term Definition > D&C 1:37-38
The Savior and his prophets are "one" for section 1.

37 Search these commandments, for they are true and faithful, and the prophecies and promises which are in them shall all be fulfilled.
38 What I the Lord have spoken, I have spoken, and I excuse not myself; and though the heavens and the earth pass away, my word shall not pass away, but shall all be fulfilled, whether by mine own voice or by the voice of my servants, it is the same.
Prophets and Revelatio,{The only true and living church
D&C - < Term Definition > D&C 1:30
The only true and living church is #1

30 And also those to whom these commandments were given, might have power to lay the foundation of this church, and to bring it forth out of obscurity and out of darkness, the only true and living church upon the face of the whole earth, with which I, the Lord, am well pleased, speaking unto the church collectively and not individually-
The Restoratio,{Look unto Christ in every thought
D&C - < Term Definition > D&C 6:36
The eye for "look"
The Savior is the thought

36 Look unto me in every thought; doubt not, fear not.
Acquiring Spiritual Knowledg,{The Holy Ghost speaks to our minds and hearts.
D&C - < Term Definition > D&C 8:2-3
Brain = mind
Heart = heart

2 Yea, behold, I will tell you in your mind and in your heart, by the Holy Ghost, which shall come upon you and which shall dwell in your heart.
3 Now, behold, this is the spirit of revelation; behold, this is the spirit by which Moses brought the children of Israel through the Red Sea on dry ground.
Acquiring Spiritual Knowledg,{Keys of the Aaronic Priesthood
D&C - < Term Definition > D&C 13:1
The key (1) is Joseph
The 3 is Oliver
John ordaining them to the priesthood

1 Upon you my fellow servants, in the name of Messiah I confer the Priesthood of Aaron, which holds the keys of the ministering of angels, and of the gospel of repentance, and of baptism by immersion for the remission of sins; and this shall never be taken again from the earth, until the sons of Levi do offer again an offering unto the Lord in righteousness.
Priesthood and Priesthood Key,{The worth of souls is great
D&C - < Term Definition > D&C 18:10-11
$ = worth
Shoes = souls

10 Remember the worth of souls is great in the sight of God;
11 For, behold, the Lord your Redeemer suffered death in the flesh; wherefore he suffered the pain of all men, that all men might repent and come unto him.
The Atonement of Jesus Chris,{Joy in bringing souls to Jesus Christ
D&C - < Term Definition > D&C 18:15-16
18 year-old missionary jumping for joy
He must have helped convert someone

15 And if it so be that you should labor all your days in crying repentance unto this people, and bring, save it be one soul unto me, how great shall be your joy with him in the kingdom of my Father!
16 And now, if your joy will be great with one soul that you have brought unto me into the kingdom of my Father, how great will be your joy if you should bring many souls unto me!
Commandment,{The Savior suffered for our sins so we could repent.
D&C - < Term Definition > D&C 19:16-19
19 year-old sister missionaries talk about the Savior's pain and repentance

16 For behold, I, God, have suffered these things for all, that they might not suffer if they would repent;
17 But if they would not repent they must suffer even as I;
18 Which suffering caused myself, even God, the greatest of all, to tremble because of pain, and to bleed at every pore, and to suffer both body and spirit-and would that I might not drink the bitter cup, and shrink-
19 Nevertheless, glory be to the Father, and I partook and finished my preparations unto the children of men.
The Atonement of Jesus Chris,{As we receive the prophet's word in patience and faith, God will disperse the powers of darkness
D&C - < Term Definition > D&C 21:4-6
If you receive (football receiver) words of prophets, it will dispel darkness

4 Wherefore, meaning the church, thou shalt give heed unto all his words and commandments which he shall give unto you as he receiveth them, walking in all holiness before me;
5 For his word ye shall receive, as if from mine own mouth, in all patience and faith.
6 For by doing these things the gates of hell shall not prevail against you; yea, and the Lord God will disperse the powers of darkness from before you, and cause the heavens to shake for your good, and his name's glory.
Prophets and Revelatio,{Christ will come again with power and glory.
D&C - < Term Definition > D&C 29:10-11
The first time the Savior came was like a lamb (small like the number 2)
The second time He'll come like a lion (large like the number 9)

10 For the hour is nigh, and that which was spoken by mine apostles must be fulfilled; for as they spoke so shall it come to pass;
11 For I will reveal myself from heaven with power and great glory, with all the hosts thereof, and dwell in righteousness with men on earth a thousand years, and the wicked shall not stand.
The Godhea,{The Lord's representatives must be called by one who has authority
D&C - < Term Definition > D&C 42:11
4 U 2 B called (phone) you must be ordained

11 Again I say unto you, that it shall not be given to any one to go forth to preach my gospel, or to build up my church, except he be ordained by some one who has authority, and it is known to the church that he has authority and has been regularly ordained by the heads of the church.
Priesthood and Priesthood Key,{Marriage between a man and a woman is ordained of God
D&C - < Term Definition > D&C 49:15-17
He is 4 she is 9 = 49
Temple marriage

15 And again, verily I say unto you, that whoso forbiddeth to marry is not ordained of God, for marriage is ordained of God unto man.
16 Wherefore, it is lawful that he should have one wife, and they twain shall be one flesh, and all this that the earth might answer the end of its creation;
17 And that it might be filled with the measure of man, according to his creation before the world was made.
Marriage and Famil,{To repent we must confess and forsake sin
D&C - < Term Definition > D&C 58:42-43
Confessed and forsaken sins will be erased from the Savior's mind.
The "S" is a 5
The "i" is an 8

42 Behold, he who has repented of his sins, the same is forgiven, and I, the Lord, remember them no more.
43 By this ye may know if a man repenteth of his sins-behold, he will confess them and forsake them.
The Atonement of Jesus Chris,{We are required to forgive all people
D&C - < Term Definition > D&C 64:9-11
Remember 4 give has a 6 in the picture

9 Wherefore, I say unto you, that ye ought to forgive one another; for he that forgiveth not his brother his trespasses standeth condemned before the Lord; for there remaineth in him the greater sin.
10 I, the Lord, will forgive whom I will forgive, but of you it is required to forgive all men.
11 And ye ought to say in your hearts-let God judge between me and thee, and reward thee according to thy deeds.
Commandment,{Jesus Christ lives and is the Creator of worlds
D&C - < Term Definition > D&C 76:22-24
The Union 76 ball represents the many worlds Christ has made

22 And now, after the many testimonies which have been given of him, this is the testimony, last of all, which we give of him: That he lives!
23 For we saw him, even on the right hand of God; and we heard the voice bearing record that he is the Only Begotten of the Father-
24 That by him, and through him, and of him, the worlds are and were created, and the inhabitants thereof are begotten sons and daughters unto God.
The Plan of Salvatio,{The Lord is bound when we do what He says.
D&C - < Term Definition > D&C 82:10
Lord's hands are bound by golden 8

10 I, the Lord, am bound when ye do what I say; but when ye do not what I say, ye have no promise.
Ordinances and Covenant,{The power of godliness is manifest in priesthood ordinances
D&C - < Term Definition > D&C 84:20-22
The boy is 8
The priest with his arm square is like a 4

20 Therefore, in the ordinances thereof, the power of godliness is manifest.
21 And without the ordinances thereof, and the authority of the priesthood, the power of godliness is not manifest unto men in the flesh;
22 For without this no man can see the face of God, even the Father, and live.
Ordinances and Covenant,{Seek learning by study and faith
D&C - < Term Definition > D&C 88:118
Real binoculars = study
Ghost binoculars = study by faith
Boy studying

118 And as all have not faith, seek ye diligently and teach one another words of wisdom; yea, seek ye out of the best books words of wisdom; seek learning, even by study and also by faith.
Acquiring Spiritual Knowledg,{Blessings of the Word of Wisdom
D&C - < Term Definition > D&C 89:18-21
WofW for Word of Wisdom
89% grade alcohol is against WofW
Eat fruit, Vegetables etc.

18 And all saints who remember to keep and do these sayings, walking in obedience to the commandments, shall receive health in their navel and marrow to their bones;
19 And shall find wisdom and great treasures of knowledge, even hidden treasures;
20 And shall run and not be weary, and shall walk and not faint.
21 And I, the Lord, give unto them a promise, that the destroying angel shall pass by them, as the children of Israel, and not slay them. Amen.
Commandment,{The authority of the Melchizedek Priesthood
D&C - < Term Definition > D&C 107:8
The Mel Priesthood badge shows these men have a right to the presidency

8 The Melchizedek Priesthood holds the right of presidency, and has power and authority over all the offices in the church in all ages of the world, to administer in spiritual things.
Priesthood and Priesthood Key,{Priesthood power depends on one's righteousness.
D&C - < Term Definition > D&C 121:36, 41-42
The power of the priesthood can only be by righteousness, poles are ones

36 That the rights of the priesthood are inseparably connected with the powers of heaven, and that the powers of heaven cannot be controlled nor handled only upon the principles of righteousness.
41 No power or influence can or ought to be maintained by virtue of the priesthood, only by persuasion, by long-suffering, by gentleness and meekness, and by love unfeigned;
42 By kindness, and pure knowledge, which shall greatly enlarge the soul without hypocrisy, and without guile-
Priesthood and Priesthood Key,{The Father and Son have bodies of flesh and bone
D&C - < Term Definition > D&C 130:22-23
There are 3 members of the Godhead (represented by the number 3 in 130)
Christ (represented by the number 1) on the left has a body. 
His father also has a body
The Holy Ghost on the right has no (0) body.
Christ (1), Godhead (3), Holy Ghost (0)

22 The Father has a body of flesh and bones as tangible as man's; the Son also; but the Holy Ghost has not a body of flesh and bones, but is a personage of Spirit. Were it not so, the Holy Ghost could not dwell in us.
23 A man may receive the Holy Ghost, and it may descend upon him and not tarry with him.
The Godhea,{The new and everlasting covenant of marriage
D&C - < Term Definition > D&C 131:1-4
1 groom, 3 degrees, 1 bride = 131

1 In the celestial glory there are three heavens or degrees;
2 And in order to obtain the highest, a man must enter into this order of the priesthood [meaning the new and everlasting covenant of marriage];
3 And if he does not, he cannot obtain it.
4 He may enter into the other, but that is the end of his kingdom; he cannot have an increase.
Marriage and Famil,{Joseph Smith labored for our salvation
D&C - < Term Definition > D&C 135:3
Joseph Smith saved (life saver) more except for Christ. The time on the clock is 1:35 for D&C 135

3 Joseph Smith, the Prophet and Seer of the Lord, has done more, save Jesus only, for the salvation of men in this world, than any other man that ever lived in it. In the short space of twenty years, he has brought forth the Book of Mormon, which he translated by the gift and power of God, and has been the means of publishing it on two continents; has sent the fulness of the everlasting gospel, which it contained, to the four quarters of the earth; has brought forth the revelations and commandments which compose this book of Doctrine and Covenants, and many other wise documents and instructions for the benefit of the children of men; gathered many thousands of the Latter-day Saints, founded a great city, and left a fame and name that cannot be slain. He lived great, and he died great in the eyes of God and his people; and like most of the Lord's anointed in ancient times, has sealed his mission and his works with his own blood; and so has his brother Hyrum. In life they were not divided, and in death they were not separated!
Prophets and Revelatio,{God's work and glory is to bring to pass the immortality and eternal life of man
OT year (in PofGP) - < Term Definition > Moses 1:39
Moses = Moses
Shovel is #1 and stands for work
Shiny shovel = God's glory

39 For behold, this is my work and my glory-to bring to pass the immortality and eternal life of man.
The Plan of Salvatio,{Zion-one heart and one mind in righteousness.
OT Year (in PofGP) - < Term Definition > Moses 7:18
Moses has one heart and one mind
Moses with his staff = Moses 7

18 And the Lord called his people Zion, because they were of one heart and one mind, and dwelt in righteousness; and there was no poor among them.
The Restoratio,{Abraham was chosen before he was born
OT year (in PofGP) - < Term Definition > Abraham 3:22-23
Abraham Lincoln for Abraham
3 rulers

22 Now the Lord had shown unto me, Abraham, the intelligences that were organized before the world was; and among all these there were many of the noble and great ones;
23 And God saw these souls that they were good, and he stood in the midst of them, and he said: These I will make my rulers; for he stood among those that were spirits, and he saw that they were good; and he said unto me: Abraham, thou art one of them; thou wast chosen before thou wast born.
The Plan of Salvatio,{God created man in His own image
OT - < Term Definition > Genesis 1:26-27
Genesis means "the formation of something" therefore Genesis = Creation = the world
The man is Adam he is number 1 created and the stick figure is a one.

26 ¶ And God said, Let us make man in our image, after our likeness: and let them have dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth.
27 So God created man in his own image, in the image of God created he him; male and female created he them.
The Plan of Salvatio,{Multiply and replenish the earth
OT - < Term Definition > Genesis 1:28
World for Genesis 
Adam holding up 1 for Genesis 1
Family for multiply

28 And God blessed them, and God said unto them, Be fruitful, and multiply, and replenish the earth, and subdue it: and have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth.
Marriage and Famil,{Husband and wife are to be one
OT - < Term Definition > Genesis 2:24
World for Genesis
The couple makes 2
First marriage was Adam and Eve by God

24 Therefore shall a man leave his father and his mother, and shall cleave unto his wife: and they shall be one flesh.

Marriage and Famil,{Joseph resisted temptation
OT - < Term Definition > Genesis 39:9
World for Genesis
Joseph 3, Potiphar's wife 9 = 39
Potiphar's wife seducing Joseph
Joseph is shocked

9 There is none greater in this house than I; neither hath he kept back any thing from me but thee, because thou art his wife: how then can I do this great wickedness, and sin against God?
Marriage and Famil,{Keep my covenant and ye shall be a holy nation.
OT - < Term Definition > Exodus 19:5-6
X for Exodus
Sister Missionary = 19
Holes in America for Holy Nation

5 Now therefore, if ye will obey my voice indeed, and keep my covenant, then ye shall be a peculiar treasure unto me above all people: for all the earth is mine:
6 And ye shall be unto me a kingdom of priests, and an holy nation. These are the words which thou shalt speak unto the children of Israel.
Ordinances and Covenant,{God revealed the Ten Commandments.
OT - < Term Definition > Exodus 20:3-17
X = Exodus
Two X's = 20 in Roman Numbers
Tablets = 10 commandments 

Commandment,{Choose you this day whom ye will serve.
OT - < Term Definition > Joshua 24:15
Joshy Fruit = Joshua
Chewing gum (chew = choose)
2 arrows on package for choice
24 on the package for 24

15 And if it seem evil unto you to serve the Lord, choose you this day whom ye will serve; whether the gods which your fathers served that were on the other side of the flood, or the gods of the Amorites, in whose land ye dwell: but as for me and my house, we will serve the Lord.
The Plan of Salvatio,{To stand worthy in the Lord's presence, we must have clean hands and a pure heart
OT - < Term Definition > Psalm 24:3-4
Water for clean
Palms for clean hands and Psalms
Gold heart for pure heart

3 Who shall ascend into the hill of the Lord? or who shall stand in his holy place?
4 He that hath clean hands, and a pure heart; who hath not lifted up his soul unto vanity, nor sworn deceitfully.
Ordinances and Covenant,{Trust in the Lord with all thine heart, and He shall direct thy paths.
OT - < Term Definition > Proverbs 3:5-6
Trust is a verb. A PROfessional verb 
Trust Three times = 3. 
Lord in background

5 ¶ Trust in the Lord with all thine heart; and lean not unto thine own understanding.
6 In all thy ways acknowledge him, and he shall direct thy paths.
Acquiring Spiritual Knowledg,{If we repent, our sins will be as white as snow.
OT - < Term Definition > Isaiah 1:18
Eye for Isaiah like "I See Ya"
The 1's for 1
Bloodshot for scarlet
Snowflake for white as snow

18 Come now, and let us reason together, saith the Lord: though your sins be as scarlet, they shall be as white as snow; though they be red like crimson, they shall be as wool.
The Atonement of Jesus Chris,{Woe unto them that call evil good, and good evil
OT - < Term Definition > Isaiah 5:20
Eye = Isaiah
Name tag Evil wants to be called "Good"
5 just part of the tag

20 ¶ Woe unto them that call evil good, and good evil; that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter!
Acquiring Spiritual Knowledg,{The Restoration is a marvelous work and a wonder
OT - < Term Definition > Isaiah 29:13-14
Eye for Isaiah like "I see ya"
Marbelous (marbled pattern on shovel) work
"?" for wonder

13 ¶ Wherefore the Lord said, Forasmuch as this people draw near me with their mouth, and with their lips do honour me, but have removed their heart far from me, and their fear toward me is taught by the precept of men:
14 Therefore, behold, I will proceed to do a marvellous work among this people, even a marvellous work and a wonder: for the wisdom of their wise men shall perish, and the understanding of their prudent men shall be hid.
The Restoratio,{Jesus Christ bore our griefs and suffered for our sins
OT - < Term Definition > Isaiah 53:3-5
Eye for Isaiah like "I See Ya"
Tear and scars for Christ's suffering
5 and 3 fingers for 53

3 He is despised and rejected of men; a man of sorrows, and acquainted with grief: and we hid as it were our faces from him; he was despised, and we esteemed him not.
4 ¶ Surely he hath borne our griefs, and carried our sorrows: yet we did esteem him stricken, smitten of God, and afflicted.
5 But he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed.
The Atonement of Jesus Chris,{Fasting helps us to loose the bands of wickedness, undo heavy burdens, and provide for the poor
OT - < Term Definition > Isaiah 58:6-7
Eye for Isaiah like "I see ya"
Speed gun for fast
58 is speed and number for the chapter

6 Is not this the fast that I have chosen? to loose the bands of wickedness, to undo the heavy burdens, and to let the oppressed go free, and that ye break every yoke?
7 Is it not to deal thy bread to the hungry, and that thou bring the poor that are cast out to thy house? when thou seest the naked, that thou cover him; and that thou hide not thyself from thine own flesh?
Commandment,{The Sabbath is the Lord's holy day
OT - < Term Definition > Isaiah 58:13-14
Eye for Isaiah like "I see ya"
May 5th, 8th day for 58
8th is on Sunday (sabbath day)

13 ¶ If thou turn away thy foot from the sabbath, from doing thy pleasure on my holy day; and call the sabbath a delight, the holy of the Lord, honourable; and shalt honour him, not doing thine own ways, nor finding thine own pleasure, nor speaking thine own words:
14 Then shalt thou delight thyself in the Lord; and I will cause thee to ride upon the high places of the earth, and feed thee with the heritage of Jacob thy father: for the mouth of the Lord hath spoken it.
Commandment,{Jeremiah was foreordained to be a prophet.
OT - < Term Definition > Jeremiah 1:4-5
J for Jeremiah
1 is in the J
Ordained 4 times = Foreordained before he his birth

4 Then the word of the Lord came unto me, saying,
5 Before I formed thee in the belly I knew thee; and before thou camest forth out of the womb I sanctified thee, and I ordained thee a prophet unto the nations.
Prophets and Revelatio,{The Lord's watch men give warnings from Him
OT - < Term Definition > Ezekiel 3:16-17
Easy button for Ezekiel
Binoculars has a 3 on it
Watchmen (prophets) on a tower

16 And it came to pass at the end of seven days, that the word of the Lord came unto me, saying,
17 Son of man, I have made thee a watchman unto the house of Israel: therefore hear the word at my mouth, and give them warning from me.
Prophets and Revelatio,{The Bible and the Book of Mormon are joined together
OT - < Term Definition > Ezekiel 37:15-17
Easy button for Ezekiel
Sticks of Judah and Joseph become one in his hand

15 ¶ The word of the Lord came again unto me, saying,
16 Moreover, thou son of man, take thee one stick, and write upon it, For Judah, and for the children of Israel his companions: then take another stick, and write upon it, For Joseph, the stick of Ephraim, and for all the house of Israel his companions:
17 And join them one to another into one stick; and they shall become one in thine hand.
The Restoratio,{God's kingdom shall stand forever.
OT - < Term Definition > Daniel 2:44
2 Lions for Daniel 2
Stone for stone cut out
Crown for Nebuchadnezzar
In the days of these kings shall God set up a kingdom."

44 And in the days of these kings shall the God of heaven set up a kingdom, which shall never be destroyed: and the kingdom shall not be left to other people, but it shall break in pieces and consume all these kingdoms, and it shall stand for ever.
The Restoratio,{God reveals His secret to His prophets
OT - < Term Definition > Amos 3:7
Mickey is a mouse = Amos
Servant 3 cups for 3
Hand behind his back for secret

7 Surely the Lord God will do nothing, but he revealeth his secret unto his servants the prophets.
Prophets and Revelatio,{Paying tithing brings blessings
OT - < Term Definition > Malachi 3:8-10
MailGuy for Malachi
3 in Presiding Bishopric 
Tithing in his hand

8 ¶ Will a man rob God? Yet ye have robbed me. But ye say, Wherein have we robbed thee? In tithes and offerings.
9 Ye are cursed with a curse: for ye have robbed me, even this whole nation.
10 Bring ye all the tithes into the storehouse, that there may be meat in mine house, and prove me now herewith, saith the Lord of hosts, if I will not open you the windows of heaven, and pour you out a blessing, that there shall not be room enough to receive it.
Commandment,{Elijah will turn the hearts of fathers and children
OT - < Term Definition > Malachi 4:5-6
MailGuy for Malachi
4 Generation pedigree is shaped like a 4

5 ¶ Behold, I will send you Elijah the prophet before the coming of the great and dreadful day of the Lord:
6 And he shall turn the heart of the fathers to the children, and the heart of the children to their fathers, lest I come and smite the earth with a curse.
Marriage and Famil,{Let your light so shine as an example to others.
NT - < Term Definition > Matthew 5:14-16
Welcome mat for Matthew
5 finger hand holding light for the world to see.

14 Ye are the light of the world. A city that is set on an hill cannot be hid.
15 Neither do men light a candle, and put it under a bushel, but on a candlestick; and it giveth light unto all that are in the house.
16 Let your light so shine before men, that they may see your good works, and glorify your Father which is in heaven.
Commandment,{If we come unto Jesus Christ, He will ease our burdens and give us rest
NT - < Term Definition > Matthew 11:28-30
Welcome mat for Matthew
Hard working missionary came to Christ and was given rest
Bed ends = 11

28 ¶ Come unto me, all ye that labour and are heavy laden, and I will give you rest.
29 Take my yoke upon you, and learn of me; for I am meek and lowly in heart: and ye shall find rest unto your souls.
30 For my yoke is easy, and my burden is light.
The Atonement of Jesus Chris,{Jesus Christ promised to build His Church and confer the keys of the kingdom
NT - < Term Definition > Matthew 16:15-19
Welcome Mat for Matthew
Priesthood Keys in shape of 16

15 He saith unto them, But whom say ye that I am?
16 And Simon Peter answered and said, Thou art the Christ, the Son of the living God.
17 And Jesus answered and said unto him, Blessed art thou, Simon Bar-jona: for flesh and blood hath not revealed it unto thee, but my Father which is in heaven.
18 And I say also unto thee, That thou art Peter, and upon this rock I will build my church; and the gates of hell shall not prevail against it.
19 And I will give unto thee the keys of the kingdom of heaven: and whatsoever thou shalt bind on earth shall be bound in heaven: and whatsoever thou shalt loose on earth shall be loosed in heaven.
Priesthood and Priesthood Key,{Love the Lord, love thy neighbor
NT - < Term Definition > Matthew 22:36-39
Welcome mat for Matthew
2's for heart and for 22
Heart for love the lord and Neighbor (Mr. Rogers)

36 Master, which is the great commandment in the law?
37 Jesus said unto him, Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy mind.
38 This is the first and great commandment.
39 And the second is like unto it, Thou shalt love thy neighbour as thyself.
Commandment,{Jesus Christ was resurrected with a body of flesh and bone
NT - < Term Definition > Luke 24:36-39
Light saber for Luke
2 is flesh 4 is bones
Christ coming out of tomb for resurrection

36 ¶ And as they thus spake, Jesus himself stood in the midst of them, and saith unto them, Peace be unto you.
37 But they were terrified and affrighted, and supposed that they had seen a spirit.
38 And he said unto them, Why are ye troubled? and why do thoughts arise in your hearts?
39 Behold my hands and my feet, that it is I myself: handle me, and see; for a spirit hath not flesh and bones, as ye see me have.
The Atonement of Jesus Chris,{We must be born of water and of the Spirit to enter the kingdom of God
NT - < Term Definition > John 3:5
Johnny Lingo for John
3 rings in water for John 3

5 Jesus answered, Verily, verily, I say unto thee, Except a man be born of water and of the Spirit, he cannot enter into the kingdom of God.
Ordinances and Covenant,{Do God's will to know His Doctrine
NT - < Term Definition > John 7:17
Johnny Lingo = John
Doing God's will he knows the Doctrine
Check mark = 7

17 If any man will do his will, he shall know of the doctrine, whether it be of God, or whether I speak of myself.
Acquiring Spiritual Knowledg,{If ye love me, keep my commandments.
NT - < Term Definition > John 14:15
Johnny Lingo for John
Valentine's day in on the 14th
Heart for love
Tablets for keep the commandments

15 ¶ If ye love me, keep my commandments.
Commandment,{The Lord chooses and ordains apostles and prophets.
NT - < Term Definition > John 15:16
Johnny Lingo for John
15 prophets chosen and ordained by God

16 Ye have not chosen me, but I have chosen you, and ordained you, that ye should go and bring forth fruit, and that your fruit should remain: that whatsoever ye shall ask of the Father in my name, he may give it you.
Prophets and Revelatio,{Eternal life is knowing God and Jesus Christ.
NT - < Term Definition > John 17:3
Johnny Lingo for John, he knows Christ
Eternal life is glory of the sun
17 out of 17 individuals surveyed in heaven showed they know God and his Son.

3 And this is life eternal, that they might know thee the only true God, and Jesus Christ, whom thou hast sent.
The Plan of Salvatio,{Peter prophesied of the Restoration
NT - < Term Definition > Acts 3:19-21
Ax for Acts
1st vision starts the Restoration
3 in the picture for Acts 3

19 ¶ Repent ye therefore, and be converted, that your sins may be blotted out, when the times of refreshing shall come from the presence of the Lord;
20 And he shall send Jesus Christ, which before was preached unto you:
21 Whom the heaven must receive until the times of restitution of all things, which God hath spoken by the mouth of all his holy prophets since the world began.
The Restoratio,{We can only know the things of God through the Spirit.
NT - < Term Definition > 1 Corinthians 2:5, 9-11
Apple core for "Cor"inthians 
All Corinthians = 1 Corinthians
Dove = Spirit
Apple core = 2 for 1 Corinthians 2
Girl learning things of God by the Spirit

5 That your faith should not stand in the wisdom of men, but in the power of God.
9 But as it is written, Eye hath not seen, nor ear heard, neither have entered into the heart of man, the things which God hath prepared for them that love him.
10 But God hath revealed them unto us by his Spirit: for the Spirit searcheth all things, yea, the deep things of God.
11 For what man knoweth the things of a man, save the spirit of man which is in him? even so the things of God knoweth no man, but the Spirit of God.
Acquiring Spiritual Knowledg,{Your body is a temple
NT - < Term Definition > 1 Corinthians 6:19-20
Apple Core for Corinthians and 6
Body made of temple parts

19 What? know ye not that your body is the temple of the Holy Ghost which is in you, which ye have of God, and ye are not your own?
20 For ye are bought with a price: therefore glorify God in your body, and in your spirit, which are God's.
The Plan of Salvatio,{Only together can a man and a woman fulfill the Lord's plan
NT - < Term Definition > 1 Corinthians 11:11
Core for 1 Corinthians
1 man and 1 woman for 11 = marriage

11 Nevertheless neither is the man without the woman, neither the woman without the man, in the Lord.
Marriage and Famil,{In Christ shall all be resurrected.
NT - < Term Definition > 1 Corinthians 15:20-22
Core 15 for 1 Corinthians 15
Bites in the apple from Adam and Eve which introduced death
In Christ all will be made alive

20 But now is Christ risen from the dead, and become the firstfruits of them that slept.
21 For since by man came death, by man came also the resurrection of the dead.
22 For as in Adam all die, even so in Christ shall all be made alive.
The Plan of Salvatio,{There are three degrees of glory in the Resurrection.
NT - < Term Definition > 1 Corinthians 15:40-42
Core 15 for 1 Corinthians 15
Sun, moon, stars for 3 degrees of glory

40 There are also celestial bodies, and bodies terrestrial: but the glory of the celestial is one, and the glory of the terrestrial is another.
41 There is one glory of the sun, and another glory of the moon, and another glory of the stars: for one star differeth from another star in glory.
42 So also is the resurrection of the dead. It is sown in corruption; it is raised in incorruption:
The Plan of Salvatio,{The Lord's Church is founded on apostles and prophets.
NT - < Term Definition > Ephesians 2:19-20
E's for Ephesians
2 E's for chapter 2
Church built on foundation of prophets and apostles, Christ is the chief cornerstone

19 Now therefore ye are no more strangers and foreigners, but fellowcitizens with the saints, and of the household of God;
20 And are built upon the foundation of the apostles and prophets, Jesus Christ himself being the chief corner stone;
Prophets and Revelatio,{Apostles and prophets help perfect the Saints
NT - < Term Definition > Ephesians 4:11-14
Four E's = Ephesians 4
All end in "S" which is Perfect for Saints

11 And he gave some, apostles; and some, prophets; and some, evangelists; and some, pastors and teachers;
12 For the perfecting of the saints, for the work of the ministry, for the edifying of the body of Christ:
13 Till we all come in the unity of the faith, and of the knowledge of the Son of God, unto a perfect man, unto the measure of the stature of the fulness of Christ:
14 That we henceforth be no more children, tossed to and fro, and carried about with every wind of doctrine, by the sleight of men, and cunning craftiness, whereby they lie in wait to deceive;
Prophets and Revelatio,{Apostasy was foretold
NT - < Term Definition > 2 Thessalonians 2:1-3
2nd for Second Coming
2 Thistles for 2 Thessalonians
2nd also for chapter 2
Falling church for Apostacy

1 Now we beseech you, brethren, by the coming of our Lord Jesus Christ, and by our gathering together unto him,
2 That ye be not soon shaken in mind, or be troubled, neither by spirit, nor by word, nor by letter as from us, as that the day of Christ is at hand.
3 Let no man deceive you by any means: for that day shall not come, except there come a falling away first, and that man of sin be revealed, the son of perdition;
The Restoratio,{Scriptures can make you wise unto salvation
NT - < Term Definition > 2 Timothy 3:15-17
2 Tiny Tims for 2 Timothy
3 Scriptures for 3

15 And that from a child thou hast known the holy scriptures, which are able to make thee wise unto salvation through faith which is in Christ Jesus.
16 All scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction, for instruction in righteousness:
17 That the man of God may be perfect, throughly furnished unto all good works.
Acquiring Spiritual Knowledg,{God is the Father of our spirits
NT - < Term Definition > Hebrews 12:9
Ghosts with ties are HeBoos,
Egg carton = 12
God is the Father of our spirits

9 Furthermore we have had fathers of our flesh which corrected us, and we gave them reverence: shall we not much rather be in subjection unto the Father of spirits, and live?
The Godhea,{If you lack wisdom, ask God
NTterm-2 - < Term Definition > James 1:5-6
King James (notice crown) Bible for James
? = Lack wisdom
Prayer hands = asking

5 If any of you lack wisdom, let him ask of God, that giveth to all men liberally, and upbraideth not; and it shall be given him.
6 But let him ask in faith, nothing wavering. For he that wavereth is like a wave of the sea driven with the wind and tossed.
Acquiring Spiritual Knowledg,{Faith without works is dead
NT - < Term Definition > James 2:17-18
King James (notice crowns) Bible for James
2 Bibles for James 2
No works is dead

17 Even so faith, if it hath not works, is dead, being alone.
18 Yea, a man may say, Thou hast faith, and I have works: shew me thy faith without thy works, and I will shew thee my faith by my works.
The Atonement of Jesus Chris,{The gospel is preached to the dead
NT - < Term Definition > 1 Peter 4:6
1 (one) Peter pan
Preaching gospel to 4 dead people

6 For for this cause was the gospel preached also to them that are dead, that they might be judged according to men in the flesh, but live according to God in the spirit.
The Plan of Salvatio,{Each person will stand before God to be judged
NT - < Term Definition > Revelation 20:12
The yellow rays = Revelation
People standing before Christ to be judged 
20 in cloud for 20
And I saw the dead, small and great, stand before God; and the books were opened: and another book was opened, which is the book of life: and the dead were judged out of those things which were written in the books, according to their works.
The Plan of Salvatio,{]